---
title: Assemblies
order: 72
thumbnail: /static/images/guides/revit-assemblies.png
subtitle: Workflows for Revit Assemblies
group: Containers
---

## Querying Assemblies

Use the {% include ltr/comp.html uuid='fd5b45c3' %} component to find all the existing Assemblies in the project.

{% capture api_note %}
In Revit API, Worksets are represented by the {% include api_type.html type='Autodesk.Revit.DB.AssemblyInstance' title='DB.AssemblyInstance' %}.
{% endcapture %}
{% include ltr/api_note.html note=api_note %}

## Finding Specific Assembly

To find a Assembly by name use the {% include ltr/comp.html uuid='fd5b45c3' %} component.

## Reading Assembly Elements

Get or Set Assembly Elements using the {% include ltr/comp.html uuid='33ead71b' %} component.

## Creating an Assembly

Create a new Assembly Type with the {% include ltr/comp.html uuid='6915b697' %} component.

## Adding Assembly to Project

Add an Assembly Type to a Project Location with the {% include ltr/comp.html uuid='26feb2e9' %} component.

## Disassemble Assembly

Disassemble Assembly instance with the {% include ltr/comp.html uuid='ff0f49ca' %} component.

## Assembly Origin

Get and Set the Assembly Origin with the {% include ltr/comp.html uuid='1c1cc766' %} component.